i'm terribly sorry @KiaraGrouwstra ... i'm going to need to you provide a concrete example - something in my brain isn't clicking :sweat:

i started with this `flake.nix`:

```
{
  inputs = {
    teraflops.url = "github:aanderse/teraflops";
    teraflops.inputs.nixpkgs.follows = "nixpkgs";
  };

  outputs = { nixpkgs, teraflops, ... }:
    let
      system = "x86_64-linux";

      pkgs = nixpkgs.legacyPackages.${system};

      # NOTE: this is a workaround while opentofu support is being improved in nixpkgs... see https://github.com/NixOS/nixpkgs/issues/283015 for details 
      tofuProvider = provider:
        provider.override (oldArgs: {
          provider-source-address =
            pkgs.lib.replaceStrings
              [ "https://registry.terraform.io/providers" ]
              [ "registry.opentofu.org" ]
              oldArgs.homepage;
        });
    in
    {
      devShells.${system}.default = with pkgs;
        mkShell {
          pname = "teraflops-virtualbox";

          packages = [
            colmena
            jq
            (opentofu.withPlugins (p: map tofuProvider [ p.tls p.virtualbox ]))
            teraflops.packages.${system}.default
          ];
        };
    } // {
      teraflops = {
        imports = [ teraflops.modules.virtualbox ];

        meta = {
          nixpkgs = nixpkgs.legacyPackages.${system};
        };

        defaults = { config, ... }: {
          deployment.targetEnv = "virtualbox";
          deployment.virtualbox = {
            cpus = 2;
            memory = "1.0 gib";
          };

          system.stateVersion = "24.05";
        };

        machine = { pkgs, ... }: {
          environment.systemPackages = [ pkgs.hello ];
        };
      };
    };
}
```

i ran `teraflops init`

when i ran `teraflops plan` i got what i expected:

```
OpenTofu will perform the following actions:

  # tls_private_key.teraflops will be created
  + resource "tls_private_key" "teraflops" {
      + algorithm                     = "ED25519"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # virtualbox_vm.machine will be created
  + resource "virtualbox_vm" "machine" {
      + cpus   = 2
      + id     = (known after apply)
      + image  = "/nix/store/570y6v70xkfb81zqs1zwcds2z83gzlzw-nixos-ova-24.05pre-git-x86_64-linux/nixos-24.05pre-git-x86_64-linux.ova"
      + memory = "1.0 gib"
      + name   = "machine"
      + status = "running"

      + network_adapter {
          + device                 = "IntelPro1000MTServer"
          + host_interface         = "vboxnet0"
          + ipv4_address           = (known after apply)
          + ipv4_address_available = (known after apply)
          + mac_address            = (known after apply)
          + status                 = (known after apply)
          + type                   = "hostonly"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

then i added the following configuration to `flake.nix` in the `teraflops` section:

```
        machine2 = { pkgs, ... }: {
          environment.systemPackages = [ pkgs.hello ];
        };
```

again, when i ran `teraflops plan` i got what i expected:

```
OpenTofu will perform the following actions:

  # tls_private_key.teraflops will be created
  + resource "tls_private_key" "teraflops" {
      + algorithm                     = "ED25519"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # virtualbox_vm.machine will be created
  + resource "virtualbox_vm" "machine" {
      + cpus   = 2
      + id     = (known after apply)
      + image  = "/nix/store/570y6v70xkfb81zqs1zwcds2z83gzlzw-nixos-ova-24.05pre-git-x86_64-linux/nixos-24.05pre-git-x86_64-linux.ova"
      + memory = "1.0 gib"
      + name   = "machine"
      + status = "running"

      + network_adapter {
          + device                 = "IntelPro1000MTServer"
          + host_interface         = "vboxnet0"
          + ipv4_address           = (known after apply)
          + ipv4_address_available = (known after apply)
          + mac_address            = (known after apply)
          + status                 = (known after apply)
          + type                   = "hostonly"
        }
    }

  # virtualbox_vm.machine2 will be created
  + resource "virtualbox_vm" "machine2" {
      + cpus   = 2
      + id     = (known after apply)
      + image  = "/nix/store/570y6v70xkfb81zqs1zwcds2z83gzlzw-nixos-ova-24.05pre-git-x86_64-linux/nixos-24.05pre-git-x86_64-linux.ova"
      + memory = "1.0 gib"
      + name   = "machine2"
      + status = "running"

      + network_adapter {
          + device                 = "IntelPro1000MTServer"
          + host_interface         = "vboxnet0"
          + ipv4_address           = (known after apply)
          + ipv4_address_available = (known after apply)
          + mac_address            = (known after apply)
          + status                 = (known after apply)
          + type                   = "hostonly"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

again, sorry for the hassle... but i really appreciate you finding issues and reporting!